app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test123"], ["LIMIT", 1]]
---
  def valid_user?
    @user = User.find_by(username: params[:valid_user][:valid_user])